{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "No PII",
    "1": "name",
    "2": "email",
    "3": "phone number",
    "4": "SSN",
    "5": "address",
    "6": "login credentials"
  },
  "initializer_range": 0.02,
  "label2id": {
    "No PII": 0,
    "SSN": 4,
    "address": 5,
    "email": 2,
    "login credentials": 6,
    "name": 1,
    "phone number": 3
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.55.4",
  "vocab_size": 30522
}
